#!/usr/bin/env python
# -*- coding: utf-8 -*-
#
# author: wq
# description: ""


class ZhouYi:
    gua_xiang = {
        "乾": {"卦数": 1, "五行": "金", "旺": "秋", "衰": "夏", "象例": "三连"},
        "兑": {"卦数": 2, "五行": "金", "旺": "秋", "衰": "夏", "象例": "上缺"},
        "离": {"卦数": 3, "五行": "火", "旺": "夏", "衰": "冬", "象例": "中虚"},
        "震": {"卦数": 4, "五行": "木", "旺": "春", "衰": "秋", "象例": "仰盂"},
        "巽": {"卦数": 5, "五行": "木", "旺": "春", "衰": "秋", "象例": "下断"},
        "坎": {"卦数": 6, "五行": "水", "旺": "冬", "衰": "辰戌丑未", "象例": "中满"},
        "艮": {"卦数": 7, "五行": "土", "旺": "辰戌丑未", "衰": "春", "象例": "覆碗"},
        "坤": {"卦数": 8, "五行": "土", "旺": "辰戌丑未", "衰": "春", "象例": "六断"}
    }
    wu_xing = {
        "金": {"生": "水", "克": "木", "被生": "土", "被克": "火", "天干": "庚辛西方", "地支": ["申金", "酉鸡"]},
        "木": {"生": "火", "克": "土", "被生": "土", "被克": "金", "天干": "甲乙东方", "地支": ["寅虎", "卯兔"]},
        "水": {"生": "木", "克": "火", "被生": "金", "被克": "土", "天干": "壬癸北方", "地支": ["子鼠", "亥猪"]},
        "火": {"生": "土", "克": "金", "被生": "木", "被克": "水", "天干": "丙丁南方", "地支": ["巳蛇", "午马"]},
        "土": {"生": "金", "克": "水", "被生": "火", "被克": "木", "天干": "戊己中央", "地支": ["丑牛", "辰龙", "未羊", "戌犬"]},
    }


def main():
    pass


if __name__ == '__main__':
    main()
